dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_filter.c
/***************************************************************************//**
* \file cy_capsense_filter.c
* \version 1.1
*
* \brief
* This file contains the source code of all filters implementation.
*
********************************************************************************
* \copyright
* Copyright 2018-2019, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "stddef.h"
#include "cy_capsense_filter.h"
#include "cy_capsense_common.h"
#include "cy_capsense_lib.h"


/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_IIR_BL_SHIFT                                (8u)

#define CY_CAPSENSE_IIR_SHIFT_STANDARD                          (0u)
#define CY_CAPSENSE_IIR_SHIFT_PERFORMANCE                       (8u)

#define CY_CAPSENSE_RC_MEDIAN_SIZE                              (2u)
#define CY_CAPSENSE_RC_IIR_SIZE                                 (1u)
#define CY_CAPSENSE_RC_AVG_SIZE                                 (3u)

/* IIR filter constant */
#define CY_CAPSENSE_IIR_COEFFICIENT_K                   (256u)


/*******************************************************************************
* Function Name: Cy_CapSense_UpdateAllBaselines
****************************************************************************//**
*
* Updates the baseline for all the sensors in all the widgets.
*
* Updates the baseline for all the sensors in all the widgets. Baseline 
* updating is a part of data processing performed by the process functions. 
* So, no need to call this function except when a specific process flow is 
* implemented.
*
* This function ignores the widget enable bit in the widget status register. 
* Multiple calling of this function (or any other function with a baseline 
* updating task) without scanning leads to unexpected behavior.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the update baseline operation of all the widgets:
* - CY_RET_SUCCESS  - The operation is successfully completed.
* - CY_RET_BAD_DATA - The baseline processing failed.
*
*******************************************************************************/
cy_status Cy_CapSense_UpdateAllBaselines(const cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    cy_status bslnStatus = CY_RET_SUCCESS;

    for(wdIndex = context->ptrCommonConfig->numWd; wdIndex-- > 0u;)
    {
        bslnStatus |= Cy_CapSense_UpdateWidgetBaseline(wdIndex, context);
    }

    return(bslnStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_UpdateWidgetBaseline
****************************************************************************//**
*
* Updates the baselines for all the sensors in a widget specified by the 
* input parameter.
*
* This function performs exactly the same tasks as
* Cy_CapSense_UpdateAllBaselines() but only for a specified widget.
*
* This function ignores the widget enable bit in the widget status register. 
* Multiple calling of this function (or any other function with a baseline 
* updating task) without scanning leads to unexpected behavior.
*
* \param widgetId
* Specifies the ID number of the widget to update the baseline of all the 
* sensors in the widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget update baseline operation:
* - CY_RET_SUCCESS - The operation is successfully completed.
* - CY_RET_BAD_DATA - The baseline processing failed.
*
*******************************************************************************/
cy_status Cy_CapSense_UpdateWidgetBaseline(
                uint32_t widgetId, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    cy_status bslnStatus = CY_RET_SUCCESS;

    for(snsIndex = context->ptrWdConfig[widgetId].numSns; snsIndex-- > 0u;)
    {
        bslnStatus |= Cy_CapSense_UpdateSensorBaseline(widgetId, snsIndex, context);
    }

    return(bslnStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_UpdateSensorBaseline
****************************************************************************//**
*
* Updates the baseline for a sensor in a widget specified by the 
* input parameters.
*
* This function performs exactly the same tasks as
* Cy_CapSense_UpdateAllBaselines() and Cy_CapSense_UpdateWidgetBaseline() 
* but only for a specified sensor.
*
* This function ignores the widget enable bit in the widget status register. 
* Multiple calling of this function (or any other function with a baseline 
* updating task) without scanning leads to unexpected behavior.
*
* \param widgetId
* Specifies the ID number of the widget to update the baseline of the sensor
* specified by the sensorId argument.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget to update baseline.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified sensor update baseline operation:
* - CY_RET_SUCCESS - The operation is successfully completed.
* - CY_RET_BAD_DATA - The baseline processing failed.
*
*******************************************************************************/
cy_status Cy_CapSense_UpdateSensorBaseline(
                uint32_t widgetId, 
                uint32_t sensorId, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t result;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];

    result = Cy_CapSense_FtUpdateBaseline(ptrWdCfg->ptrWdContext, &ptrWdCfg->ptrSnsContext[sensorId], context);

    return (result);
}

