dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_filter.c
/*******************************************************************************
* Function Name: Cy_CapSense_FtUpdateBaseline
****************************************************************************//**
*
* Updates the baseline for a sensor specified by an input parameter.
*
* Check a matching of present baseline and its inverse duplication. If they
* match, then the function updates the baseline for a sensor specified by an input parameter.
* If they don't match, the function returns CY_CAPSENSE_TST_BSLN_DUPLICATION
* result and doesn't update the baseline.
*
* \param ptrWdContext
* The pointer to the widget context structure where all the widget parameters
* are stored.
*
* \param ptrSnsContext
* The pointer to the sensor context structure where the sensor data
* is stored.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status indicating whether the baseline has been updated:
* - Zero - if baseline updating was successful.
* - Non-zero - if present sensor's any channel baseline and its inversion
* doesn't match.
*
*******************************************************************************/
uint32_t Cy_CapSense_FtUpdateBaseline(
                const cy_stc_capsense_widget_context_t * ptrWdContext,
                cy_stc_capsense_sensor_context_t * ptrSnsContext,
                const cy_stc_capsense_context_t * context)
{
    uint32_t result = CY_RET_SUCCESS;
    uint32_t bslnHistory;

    /* Reset negative baseline counter */
    if(ptrSnsContext->raw >= ptrSnsContext->bsln)
    {
        ptrSnsContext->negBslnRstCnt = 0u;
    }

    /* Reset baseline */
    if (ptrSnsContext->bsln > (ptrWdContext->nNoiseTh + ptrSnsContext->raw))
    {
        if (ptrSnsContext->negBslnRstCnt >= ptrWdContext->lowBslnRst)
        {
            Cy_CapSense_FtInitializeBaseline(ptrSnsContext);
        }
        else
        {
            ptrSnsContext->negBslnRstCnt++;
        }
    }
    else
    {
        /* 
        * Update baseline only if:
        * - signal is in range between noiseThreshold and negativenoiseThreshold
        * or
        * - sensor Auto-reset is enabled
        */
        if ((0u != context->ptrCommonConfig->swSensorAutoResetEn) || 
            (ptrSnsContext->raw <= (ptrWdContext->noiseTh + ptrSnsContext->bsln)))
        {
            /* Get real baseline */
            bslnHistory = ((uint32_t)ptrSnsContext->bsln << CY_CAPSENSE_IIR_BL_SHIFT) | ptrSnsContext->bslnExt;
            /* Calculate baseline value */
            bslnHistory = Cy_CapSense_FtIIR1stOrder((uint32_t)ptrSnsContext->raw << CY_CAPSENSE_IIR_BL_SHIFT, bslnHistory, (uint32_t)ptrWdContext->bslnCoeff);
            /* Split baseline */
            ptrSnsContext->bsln = CY_LO16(bslnHistory >> CY_CAPSENSE_IIR_BL_SHIFT);
            ptrSnsContext->bslnExt = CY_LO8(bslnHistory);
        }
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeAllBaselines
****************************************************************************//**
*
* Initializes the baselines of all the sensors of all the widgets.
*
* Also, this function can be used to re-initialize baselines. 
*
* Calling this function is accompanied by 
* - Cy_CapSense_InitializeAllStatuses().
* - Cy_CapSense_InitializeAllFilters().
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeAllBaselines(cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;

    for(wdIndex = context->ptrCommonConfig->numWd; wdIndex-- > 0u;)
    {
        Cy_CapSense_InitializeWidgetBaseline(wdIndex, context);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeWidgetBaseline
****************************************************************************//**
*
* Initializes the baselines of all the sensors in a widget
* specified by the input parameter.
*
* Calling this function is accompanied by 
* - Cy_CapSense_InitializeWidgetStatus().
* - Cy_CapSense_InitializeWidgetFilter().
*
* \param widgetId
* Specifies the ID number of a widget to initialize the baseline 
* of all the sensors in the widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeWidgetBaseline(
                uint32_t widgetId, 
                cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;

    for(snsIndex = context->ptrWdConfig[widgetId].numSns; snsIndex-- > 0u;)
    {
        Cy_CapSense_InitializeSensorBaseline(widgetId, snsIndex, context);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeSensorBaseline
****************************************************************************//**
*
* Initializes the baseline of a sensor in a widget specified
* by the input parameters.
*
* \param widgetId
* Specifies the ID number of a widget to initialize the baseline of the sensor
* in the widget.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget to initialize its
* baseline.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeSensorBaseline(
                uint32_t widgetId, 
                uint32_t sensorId, 
                cy_stc_capsense_context_t * context)
{
    uint32_t freqChIndex;
    uint32_t freqChNumber;
    uint32_t cxtOffset;

    freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;
    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
    {
        cxtOffset = sensorId + (freqChIndex * context->ptrCommonConfig->numSns);
        Cy_CapSense_FtInitializeBaseline(&context->ptrWdConfig[widgetId].ptrSnsContext[cxtOffset]);
    }
}


