dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_filter.c
/*******************************************************************************
* Function Name: Cy_CapSense_FtInitializeBaseline
****************************************************************************//**
*
* Initializes the baseline history for a sensor indicated by an input
* parameter.
*
* \param ptrSnsContext 
* The pointer to the sensor context structure.
*
*******************************************************************************/
void Cy_CapSense_FtInitializeBaseline(cy_stc_capsense_sensor_context_t * ptrSnsContext)
{
    ptrSnsContext->bslnExt = 0u;
    ptrSnsContext->bsln = ptrSnsContext->raw;
    ptrSnsContext->negBslnRstCnt = 0u;
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeAllFilters
****************************************************************************//**
*
* Initializes all the firmware filter history, except the baseline filter.
*
* Calling this function is accompanied by 
* - Cy_CapSense_InitializeAllStatuses().
* - Cy_CapSense_InitializeAllBaselines().
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeAllFilters(const cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;

    for(widgetId = context->ptrCommonConfig->numWd; widgetId-- > 0u;)
    {
        Cy_CapSense_InitializeWidgetFilter(widgetId, context);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeWidgetFilter
****************************************************************************//**
*
* Initializes (or re-initializes) the raw count filter history of all 
* the sensors in a widget specified by the input parameter.
*
* Calling this function is accompanied by 
* - Cy_CapSense_InitializeWidgetStatus().
* - Cy_CapSense_InitializeWidgetBaseline().
*
* \param widgetId
* Specifies the ID number of a widget to initialize the filter history of all
* the sensors in the widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeWidgetFilter(
                uint32_t widgetId, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    uint32_t freqChIndex;
    uint32_t freqChNumber;
    uint32_t snsHistorySize;
    uint32_t cxtOffset;
    uint32_t historyOffset;
        
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    
    uint32_t rawFilterCfg = ptrWdCfg->rawFilterConfig;
    uint8_t * ptrHistoryLow = NULL;
    uint16_t * ptrHistory;
    cy_stc_capsense_sensor_context_t * ptrSnsCtx ;
    cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNEHistory;

    freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;
    snsHistorySize = (uint32_t)ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK;
    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
    {
        for(snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
        {
            cxtOffset = snsIndex + (freqChIndex * context->ptrCommonConfig->numSns);
            historyOffset = snsHistorySize * (snsIndex + (freqChIndex * context->ptrCommonConfig->numSns));
            ptrSnsCtx = &ptrWdCfg->ptrSnsContext[cxtOffset];
            ptrHistory = &ptrWdCfg->ptrRawFilterHistory[historyOffset];

            if(CY_CAPSENSE_IIR_FILTER_PERFORMANCE == (ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_IIR_MODE_MASK))
            {
                ptrHistoryLow = &ptrWdCfg->ptrRawFilterHistoryLow[cxtOffset];
            }

            if(0u != (CY_CAPSENSE_RC_FILTER_MEDIAN_EN_MASK & rawFilterCfg))
            {
                Cy_CapSense_InitializeMedianInternal(ptrWdCfg, ptrSnsCtx, ptrHistory);
                ptrHistory += CY_CAPSENSE_RC_MEDIAN_SIZE;
            }

            if(0u != (CY_CAPSENSE_RC_FILTER_IIR_EN_MASK & rawFilterCfg))
            {
                Cy_CapSense_InitializeIIRInternal(ptrWdCfg, ptrSnsCtx, ptrHistory, ptrHistoryLow);
                ptrHistory += CY_CAPSENSE_RC_IIR_SIZE;
            }
                
            if(0u != (CY_CAPSENSE_RC_FILTER_AVERAGE_EN_MASK & rawFilterCfg))
            {
                Cy_CapSense_InitializeAverageInternal(ptrWdCfg, ptrSnsCtx, ptrHistory);
            }
        }
    }
    
    if (CY_CAPSENSE_CSD_SS_HWTH_EN == context->ptrCommonConfig->csdAutotuneEn)
    {
        /* Noise envelope is available for CSD widgets only */
        if ((uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E == ptrWdCfg->senseMethod)
        {
            ptrSnsCtx = ptrWdCfg->ptrSnsContext;
            ptrNEHistory = ptrWdCfg->ptrNoiseEnvelope;
            for(snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
            {
                Cy_CapSense_InitializeNoiseEnvelope_Lib(ptrSnsCtx->raw, ptrWdCfg->ptrWdContext->sigPFC, ptrNEHistory);
                ptrSnsCtx++;
                ptrNEHistory++;
            }
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeIIR
****************************************************************************//**
*
* Initializes the IIR filter history.
*
* \param widgetId 
* Specifies the ID number of the widget.
*
* \param sensorId 
* Specifies the ID number of the sensor in the widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeIIR(
                uint32_t widgetId, 
                uint32_t sensorId, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsHistorySize;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_sensor_context_t * ptrSnsCtx;
    
    ptrWdCfg = &context->ptrWdConfig[widgetId];
    ptrSnsCtx = &ptrWdCfg->ptrSnsContext[sensorId];
    snsHistorySize = (uint32_t)ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK;
    
